In [1]:
import pandas as pd

In [10]:
df=pd.read_excel("company salary.xlsx")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [12]:
#independent variables stored in inputs
#dependent var stored in target
inputs=df.drop("salary_more_then_100k", axis = 'columns')
target = df["salary_more_then_100k"]

In [13]:
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [14]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [19]:
#steps to convert label columns into numbers
from sklearn.preprocessing import LabelEncoder

In [20]:
#creating 3 differnt objects for the 3 columns
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [21]:
#create extra column in the df
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [22]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [28]:
#to drop the label columns
inputs_n=inputs.drop(['company','job','degree'], axis = 'columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [31]:
#prediction througth decision tree classifier
from sklearn import tree

In [33]:
#creating a model
model=tree.DecisionTreeClassifier()

In [34]:
#training the model
#splitting the dataset is advised
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [35]:
#accuracy
model.score(inputs_n,target)

1.0

In [36]:
model.predict([[2,0,1]])

array([1], dtype=int64)